#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

The remote workspace is configured to work with configuration at
envs/staging relative to the target repository.

Terraform will upload the contents of the following directory,
excluding files or directories as defined by a .terraformignore file
at /home/runner/work/terraform-play/terraform-play/.terraformignore (if it is present),
in order to capture the filesystem context the remote workspace expects:
    /home/runner/work/terraform-play/terraform-play

To view this run in a browser, visit:
https://app.terraform.io/app/utwo/terra-play/runs/run-PSRik6xaXNY2QrGA

Waiting for the plan to start...

Terraform v1.2.4
on linux_amd64
Initializing plugins and modules...
module.web_app.random_password.password: Refreshing state... [id=none]
module.web_app.data.google_compute_network.default: Reading...
module.web_app.data.google_billing_account.billing_account: Reading...
module.web_app.google_storage_bucket.assets: Refreshing state... [id=terraform-play-assets-dev]
module.web_app.data.google_compute_network.default: Read complete after 0s [id=projects/autocode-347209/global/networks/default]
module.web_app.data.google_billing_account.billing_account: Read complete after 0s [id=01736B-DC780C-7D6C0B]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.web_app.google_billing_budget.budget will be created
  + resource "google_billing_budget" "budget" {
      + billing_account = "01736B-DC780C-7D6C0B"
      + display_name    = "Billing Budget Slow Down"
      + id              = (known after apply)
      + name            = (known after apply)

      + amount {
          + specified_amount {
              + currency_code = "USD"
              + units         = "100"
            }
        }

      + budget_filter {
          + credit_types           = (known after apply)
          + credit_types_treatment = (known after apply)
          + labels                 = (known after apply)
          + projects               = (known after apply)
          + services               = (known after apply)
          + subaccounts            = (known after apply)
        }

      + threshold_rules {
          + spend_basis       = "CURRENT_SPEND"
          + threshold_percent = 0.5
        }
    }

  # module.web_app.google_cloud_run_service.web_app_backend will be created
  + resource "google_cloud_run_service" "web_app_backend" {
      + autogenerate_revision_name = true
      + id                         = (known after apply)
      + location                   = "europe-west1"
      + name                       = "web_app_backend"
      + project                    = (known after apply)
      + status                     = (known after apply)

      + metadata {
          + annotations      = (known after apply)
          + generation       = (known after apply)
          + labels           = (known after apply)
          + namespace        = (known after apply)
          + resource_version = (known after apply)
          + self_link        = (known after apply)
          + uid              = (known after apply)
        }

      + template {
          + metadata {
              + annotations      = {
                  + "autoscaling.knative.dev/maxScale"         = "15"
                  + "run.googleapis.com/execution-environment" = "gen2"
                  + "run.googleapis.com/launch-stage"          = "BETA"
                  + "run.googleapis.com/vpc-access-connector"  = "cloudrun_vpc_serverless"
                  + "run.googleapis.com/vpc-access-egress"     = "private-ranges-only"
                }
              + generation       = (known after apply)
              + labels           = {
                  + "app" = "terraform-play"
                  + "env" = "dev"
                }
              + name             = (known after apply)
              + namespace        = (known after apply)
              + resource_version = (known after apply)
              + self_link        = (known after apply)
              + uid              = (known after apply)
            }

          + spec {
              + container_concurrency = (known after apply)
              + service_account_name  = (known after apply)
              + serving_state         = (known after apply)
              + timeout_seconds       = 3000

              + containers {
                  + image = "us-docker.pkg.dev/cloudrun/container/hello"

                  + env {
                      + name  = "APP_ENV"
                      + value = "dev"
                    }
                  + env {
                      + name  = "BCUKET_NAME"
                      + value = "terraform-play-assets-dev"
                    }
                  + env {
                      + name  = "DB_HOST"
                      + value = (known after apply)
                    }
                  + env {
                      + name  = "DB_NAME"
                      + value = "terradb-dev"
                    }
                  + env {
                      + name = "DB_PASSWORD"

                      + value_from {
                          + secret_key_ref {
                              + key  = "1"
                              + name = "db_password"
                            }
                        }
                    }
                  + env {
                      + name  = "DB_USERNAME"
                      + value = "admin"
                    }
                  + env {
                      + name  = "NODE_ENV"
                      + value = "production"
                    }
                  + env {
                      + name  = "REDIS_HOST"
                      + value = (known after apply)
                    }

                  + ports {
                      + container_port = (known after apply)
                      + name           = (known after apply)
                      + protocol       = (known after apply)
                    }

                  + resources {
                      + limits = {
                          + "cpu"    = "1000m"
                          + "memory" = "512Mi"
                        }
                    }
                }
            }
        }

      + traffic {
          + latest_revision = true
          + percent         = 100
          + url             = (known after apply)
        }
    }

  # module.web_app.google_cloud_run_service_iam_member.cloudrun_all_users will be created
  + resource "google_cloud_run_service_iam_member" "cloudrun_all_users" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + location = "europe-west1"
      + member   = "allUsers"
      + project  = (known after apply)
      + role     = "roles/run.invoker"
      + service  = "web_app_backend"
    }

  # module.web_app.google_project_service.services["billingbudgets.googleapis.com"] will be created
  + resource "google_project_service" "services" {
      + disable_dependent_services = false
      + disable_on_destroy         = false
      + id                         = (known after apply)
      + project                    = (known after apply)
      + service                    = "billingbudgets.googleapis.com"
    }

  # module.web_app.google_project_service.services["iam.googleapis.com"] will be created
  + resource "google_project_service" "services" {
      + disable_dependent_services = false
      + disable_on_destroy         = false
      + id                         = (known after apply)
      + project                    = (known after apply)
      + service                    = "iam.googleapis.com"
    }

  # module.web_app.google_project_service.services["redis.googleapis.com"] will be created
  + resource "google_project_service" "services" {
      + disable_dependent_services = false
      + disable_on_destroy         = false
      + id                         = (known after apply)
      + project                    = (known after apply)
      + service                    = "redis.googleapis.com"
    }

  # module.web_app.google_project_service.services["secretmanager.googleapis.com"] will be created
  + resource "google_project_service" "services" {
      + disable_dependent_services = false
      + disable_on_destroy         = false
      + id                         = (known after apply)
      + project                    = (known after apply)
      + service                    = "secretmanager.googleapis.com"
    }

  # module.web_app.google_project_service.services["sqladmin.googleapis.com"] will be created
  + resource "google_project_service" "services" {
      + disable_dependent_services = false
      + disable_on_destroy         = false
      + id                         = (known after apply)
      + project                    = (known after apply)
      + service                    = "sqladmin.googleapis.com"
    }

  # module.web_app.google_project_service.services["vpcaccess.googleapis.com"] will be created
  + resource "google_project_service" "services" {
      + disable_dependent_services = false
      + disable_on_destroy         = false
      + id                         = (known after apply)
      + project                    = (known after apply)
      + service                    = "vpcaccess.googleapis.com"
    }

  # module.web_app.google_redis_instance.cache will be created
  + resource "google_redis_instance" "cache" {
      + alternative_location_id  = (known after apply)
      + auth_enabled             = false
      + auth_string              = (sensitive value)
      + authorized_network       = (known after apply)
      + connect_mode             = "DIRECT_PEERING"
      + create_time              = (known after apply)
      + current_location_id      = (known after apply)
      + display_name             = "Redis Cache"
      + host                     = (known after apply)
      + id                       = (known after apply)
      + labels                   = {
          + "app" = "terraform-play"
          + "env" = "dev"
        }
      + location_id              = (known after apply)
      + memory_size_gb           = 1
      + name                     = "redis-cache"
      + nodes                    = (known after apply)
      + persistence_iam_identity = (known after apply)
      + port                     = (known after apply)
      + project                  = (known after apply)
      + read_endpoint            = (known after apply)
      + read_endpoint_port       = (known after apply)
      + read_replicas_mode       = (known after apply)
      + redis_version            = (known after apply)
      + region                   = "europe-west1"
      + replica_count            = (known after apply)
      + reserved_ip_range        = (known after apply)
      + secondary_ip_range       = (known after apply)
      + server_ca_certs          = (known after apply)
      + tier                     = "BASIC"
      + transit_encryption_mode  = "DISABLED"

      + maintenance_policy {
          + create_time = (known after apply)
          + update_time = (known after apply)

          + weekly_maintenance_window {
              + day      = "TUESDAY"
              + duration = (known after apply)

              + start_time {
                  + hours   = 0
                  + minutes = 30
                  + nanos   = 0
                  + seconds = 0
                }
            }
        }
    }

  # module.web_app.google_secret_manager_secret.db_password will be created
  + resource "google_secret_manager_secret" "db_password" {
      + create_time = (known after apply)
      + expire_time = (known after apply)
      + id          = (known after apply)
      + name        = (known after apply)
      + project     = (known after apply)
      + secret_id   = "db_password"

      + replication {
          + automatic = true
        }
    }

  # module.web_app.google_secret_manager_secret_iam_member.db_secret_access will be created
  + resource "google_secret_manager_secret_iam_member" "db_secret_access" {
      + etag      = (known after apply)
      + id        = (known after apply)
      + member    = (known after apply)
      + project   = (known after apply)
      + role      = "roles/secretmanager.secretAccessor"
      + secret_id = (known after apply)
    }

  # module.web_app.google_secret_manager_secret_version.db_password_data will be created
  + resource "google_secret_manager_secret_version" "db_password_data" {
      + create_time  = (known after apply)
      + destroy_time = (known after apply)
      + enabled      = true
      + id           = (known after apply)
      + name         = (known after apply)
      + secret       = (known after apply)
      + secret_data  = (sensitive value)
    }

  # module.web_app.google_service_account.cloud_run_service_account will be created
  + resource "google_service_account" "cloud_run_service_account" {
      + account_id   = "cloud-run-sa"
      + description  = "Service Account for main Cloud Run web app"
      + disabled     = false
      + display_name = "Cloud Run Service Account"
      + email        = (known after apply)
      + id           = (known after apply)
      + name         = (known after apply)
      + project      = (known after apply)
      + unique_id    = (known after apply)
    }

  # module.web_app.google_sql_database.terra_db will be created
  + resource "google_sql_database" "terra_db" {
      + charset   = (known after apply)
      + collation = (known after apply)
      + id        = (known after apply)
      + instance  = "terra_db"
      + name      = "terradb-dev"
      + project   = (known after apply)
      + self_link = (known after apply)
    }

  # module.web_app.google_sql_database_instance.terra_instance will be created
  + resource "google_sql_database_instance" "terra_instance" {
      + connection_name               = (known after apply)
      + database_version              = "POSTGRES_14"
      + deletion_protection           = true
      + first_ip_address              = (known after apply)
      + id                            = (known after apply)
      + ip_address                    = (known after apply)
      + master_instance_name          = (known after apply)
      + name                          = "terra_db"
      + private_ip_address            = (known after apply)
      + project                       = (known after apply)
      + public_ip_address             = (known after apply)
      + region                        = "europe-west1"
      + self_link                     = (known after apply)
      + server_ca_cert                = (known after apply)
      + service_account_email_address = (known after apply)

      + replica_configuration {
          + ca_certificate            = (known after apply)
          + client_certificate        = (known after apply)
          + client_key                = (known after apply)
          + connect_retry_interval    = (known after apply)
          + dump_file_path            = (known after apply)
          + failover_target           = (known after apply)
          + master_heartbeat_period   = (known after apply)
          + password                  = (sensitive value)
          + ssl_cipher                = (known after apply)
          + username                  = (known after apply)
          + verify_server_certificate = (known after apply)
        }

      + settings {
          + activation_policy     = "ALWAYS"
          + availability_type     = "ZONAL"
          + disk_autoresize       = true
          + disk_autoresize_limit = 0
          + disk_size             = (known after apply)
          + disk_type             = "PD_SSD"
          + pricing_plan          = "PER_USE"
          + tier                  = "db-f1-micro"
          + user_labels           = (known after apply)
          + version               = (known after apply)

          + backup_configuration {
              + enabled                        = false
              + point_in_time_recovery_enabled = true
              + start_time                     = (known after apply)
              + transaction_log_retention_days = (known after apply)

              + backup_retention_settings {
                  + retained_backups = (known after apply)
                  + retention_unit   = (known after apply)
                }
            }

          + ip_configuration {
              + ipv4_enabled    = true
              + private_network = "projects/autocode-347209/global/networks/default"

              + authorized_networks {
                  + name  = "allow all"
                  + value = "0.0.0.0/0"
                }
            }

          + location_preference {
              + follow_gae_application = (known after apply)
              + zone                   = (known after apply)
            }
        }
    }

  # module.web_app.google_sql_user.local_user will be created
  + resource "google_sql_user" "local_user" {
      + host     = (known after apply)
      + id       = (known after apply)
      + instance = "terra_db"
      + name     = "admin"
      + password = (sensitive value)
      + project  = (known after apply)
    }

  # module.web_app.google_sql_user.webapp_user will be created
  + resource "google_sql_user" "webapp_user" {
      + host     = (known after apply)
      + id       = (known after apply)
      + instance = "terra_db"
      + name     = (known after apply)
      + project  = (known after apply)
      + type     = "CLOUD_IAM_SERVICE_ACCOUNT"
    }

  # module.web_app.google_storage_bucket_iam_member.all_users_read will be created
  + resource "google_storage_bucket_iam_member" "all_users_read" {
      + bucket = "terraform-play-assets-dev"
      + etag   = (known after apply)
      + id     = (known after apply)
      + member = "allUsers"
      + role   = "roles/storage.legacyBucketWriter"
    }

  # module.web_app.google_storage_bucket_iam_member.cloud_run_member will be created
  + resource "google_storage_bucket_iam_member" "cloud_run_member" {
      + bucket = "terraform-play-assets-dev"
      + etag   = (known after apply)
      + id     = (known after apply)
      + member = (known after apply)
      + role   = "roles/storage.admin"
    }

  # module.web_app.google_vpc_access_connector.cloudrun_vpc_serverless will be created
  + resource "google_vpc_access_connector" "cloudrun_vpc_serverless" {
      + id             = (known after apply)
      + ip_cidr_range  = "10.8.0.0/28"
      + max_throughput = 300
      + min_throughput = 200
      + name           = "cloudrun_vpc_serverless"
      + network        = "default"
      + project        = (known after apply)
      + region         = (known after apply)
      + self_link      = (known after apply)
      + state          = (known after apply)
    }

Plan: 21 to add, 0 to change, 0 to destroy.


```

</details>

*Pushed by: @Utwo, Action: `pull_request`*